import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

questions = [
    "وقتی خوشحال هستید، معمولاً چه کاری انجام می‌دهید؟\n1- با دوستانم وقت می‌گذرانم\n2- فیلم می‌بینم\n3- ورزش می‌کنم\n4- خرید می‌کنم",
    "در طول روز چه زمانی احساس می‌کنید شادتر هستید؟\n1- صبح‌ها\n2- عصرها\n3- شب‌ها\n4- هیچ وقت",
    "وقتی عصبانی هستید، معمولاً چه کاری انجام می‌دهید؟\n1- فریاد می‌زنم\n2- تنها می‌شوم\n3- تلاش می‌کنم آرام شوم\n4- هیچکدام",
    "وقتی احساس غم یا اندوه می‌کنید، معمولاً چه کارهایی انجام می‌دهید؟\n1- با کسی صحبت می‌کنم\n2- گریه می‌کنم\n3- هیچ کار خاصی نمی‌کنم\n4- با خانواده‌ام وقت می‌گذرانم",
    "وقتی احساس استرس می‌کنید، معمولاً چه حسی دارید؟\n1- احساس خستگی می‌کنم\n2- نگران می‌شوم\n3- احساس فشار می‌کنم\n4- هیچ یک از این‌ها",
    "در زمان‌های استرس‌زا، معمولاً چه کاری انجام می‌دهید؟\n1- تلاش می‌کنم آرام شوم\n2- با دوستانم صحبت می‌کنم\n3- ورزش می‌کنم\n4- هیچ کاری نمی‌کنم",
    "آیا به خودتان اعتماد دارید؟\n1- همیشه\n2- گاهی اوقات\n3- ندرتاً\n4- هیچ‌وقت",
    "آیا خود را در زندگی موفق می‌بینید؟\n1- بله\n2- گاهی اوقات\n3- نه\n4- اصلاً",
    "در موقعیت‌های اجتماعی، معمولاً چه احساسی دارید؟\n1- احساس راحتی می‌کنم\n2- نگران هستم\n3- احساس گم‌گشتگی می‌کنم\n4- هیچکدام",
    "آیا ترجیح می‌دهید که بیشتر تنها باشید یا با دیگران؟\n1- تنها\n2- با دیگران\n3- بستگی به شرایط دارد\n4- هیچکدام",
    "معمولاً انرژی شما در روز چطور است؟\n1- همیشه زیاد است\n2- بیشتر مواقع پایین است\n3- انرژی متغیری دارم\n4- هیچکدام",
    "کیفیت خواب شما چطور است؟\n1- بسیار خوب است\n2- خوب است\n3- بد است\n4- هیچکدام"
]

answers = [
    ["1- با دوستانم وقت می‌گذرانم", "2- فیلم می‌بینم", "3- ورزش می‌کنم", "4- خرید می‌کنم"],
    ["1- صبح‌ها", "2- عصرها", "3- شب‌ها", "4- هیچ وقت"],
    ["1- فریاد می‌زنم", "2- تنها می‌شوم", "3- تلاش می‌کنم آرام شوم", "4- هیچکدام"],
    ["1- با کسی صحبت می‌کنم", "2- گریه می‌کنم", "3- هیچ کار خاصی نمی‌کنم", "4- با خانواده‌ام وقت می‌گذرانم"],
    ["1- احساس خستگی می‌کنم", "2- نگران می‌شوم", "3- احساس فشار می‌کنم", "4- هیچ یک از این‌ها"],
    ["1- تلاش می‌کنم آرام شوم", "2- با دوستانم صحبت می‌کنم", "3- ورزش می‌کنم", "4- هیچ کاری نمی‌کنم"],
    ["1- همیشه", "2- گاهی اوقات", "3- ندرتاً", "4- هیچ‌وقت"],
    ["1- بله", "2- گاهی اوقات", "3- نه", "4- اصلاً"],
    ["1- احساس راحتی می‌کنم", "2- نگران هستم", "3- احساس گم‌گشتگی می‌کنم", "4- هیچکدام"],
    ["1- تنها", "2- با دیگران", "3- بستگی به شرایط دارد", "4- هیچکدام"],
    ["1- همیشه زیاد است", "2- بیشتر مواقع پایین است", "3- انرژی متغیری دارم", "4- هیچکدام"],
    ["1- بسیار خوب است", "2- خوب است", "3- بد است", "4- هیچکدام"]
]

user_scores = []
for question, answer in zip(questions, answers):
    print(question)
    while True:
        try:
            user_ans = int(input("لطفا گزینه ی مورد نظر خود را وارد نمایید:\n"))
            if 1<= user_ans <= 4:
                user_scores.append(user_ans)
                break
            else:
                print("مقدار وارد شده اشتباه است، دوباره تلاش کنید.\n")
        except ValueError:
            print("ورودی نامعتبر می باشد\n")

print(user_scores)
for i, scores in enumerate(user_scores):
    print(f"سوال {i+1}: پاسخ {scores}")

avg_scores = np.mean(user_scores)

if avg_scores <= 1.5:
    avg = "بسیار منفی (احساسات منفی بالا)"
elif avg_scores <= 2.5:
    avg = "منفی (احساسات کمی منفی)"
elif avg_scores <= 3.5:
    avg = "مثبت (احساسات کمی مثبت)"
else:
    avg = "بسیار مثبت (احساسات مثبت بالا)"

plt.scatter(range(1, len(user_scores) + 1), user_scores, color='blue')
plt.xlabel("Emtiaz")
plt.ylabel("Ehsasat")
plt.title("Tahlil Ehsasat")
plt.show()

print(f"\nمیانگین امتیازات شما: {avg_scores:.2f}")
print(f"وضعیت کلی احساسات شما: {avg}")